# DataFrame

## What is DataFrame?

In [1]:
import pandas as pd

In [2]:
# Creating a dataframe using a dictionary

mydict = {
    'name':['james','roger'],
    'age':[40,35],
    'sex':['male','male'],
    'country':['sweden','us']
}
print(mydict)
df = pd.DataFrame(mydict)
df

{'name': ['james', 'roger'], 'age': [40, 35], 'sex': ['male', 'male'], 'country': ['sweden', 'us']}

    name  age   sex country
0  james   40  male  sweden
1  roger   35  male      us

In [5]:
mydict2 = {
    'Name':['Amit','Hina','Rahul','Himani'],
    'Age':[34,24,28,25],
    'Sex':['Male','Female','Male','Female'],
    'Address':['Delhi','Mumbai','Indore','Bhopal']
}
df1 = pd.DataFrame(mydict2)
df1

     Name  Age     Sex Address
0    Amit   34    Male   Delhi
1    Hina   24  Female  Mumbai
2   Rahul   28    Male  Indore
3  Himani   25  Female  Bhopal

In [6]:
# Creating a dataframe from series without column names

S1 = pd.Series(['Python','Data Science','C'])
S2 = pd.Series([20000,35000,12000])
S3 = pd.Series([2000,3000,1000])

df = pd.concat([S1,S2,S3],axis=1)
df

              0      1     2
0        Python  20000  2000
1  Data Science  35000  3000
2             C  12000  1000

In [10]:
# Creating a dataframe from series with column names

S1 = pd.Series(['Python','Data Science','C'], name='Course')
S2 = pd.Series([20000,35000,12000], name='Fee')
S3 = pd.Series([2000,3000,1000], name='Discount')

df = pd.concat([S1,S2,S3],axis=1)
df

         Course    Fee  Discount
0        Python  20000      2000
1  Data Science  35000      3000
2             C  12000      1000

In [7]:
# Creating a dataframe using list

course = ['Python','Data Science','C']
fee = [20000,35000,12000]
discount = [2000,3000,1000]

df = pd.DataFrame(zip(course,fee,discount),
                  columns=['Course','Fee','Discount'])
df

         Course    Fee  Discount
0        Python  20000      2000
1  Data Science  35000      3000
2             C  12000      1000

In [9]:
# Create a dictionary using list of tuples

myDict = dict([('Python',20000),
               ('Data Science',45000), 
               ('C',12000)])

print(myDict)

{'Python': 20000, 'Data Science': 45000, 'C': 12000}

In [10]:
df = pd.DataFrame(dict([('Python',20000),
               ('Data Science',45000), 
               ('C',12000)]), index=[0])
df

   Python  Data Science      C
0   20000         45000  12000

In [11]:
# Create a dictionary using tuple of lists

df = pd.DataFrame(dict((['Python',20000],
               ['Data Science',45000], 
               ['C',12000])), index=[0])
df

   Python  Data Science      C
0   20000         45000  12000